---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.SetItalicStatus(System.Boolean)
source: html/e61a4fe2-42f4-ba27-885d-eaa1576dcc48.htm
---
# Autodesk.Revit.DB.FormattedText.SetItalicStatus Method

Sets the characters in the entire text to be italic or not italic.

## Syntax (C#)
```csharp
public void SetItalicStatus(
	bool isItalic
)
```

## Parameters
- **isItalic** (`System.Boolean`) - The desired italic status of characters in the entire text.
 True to set italic, false to set not italic.